In [38]:
import pandas as pd

Understanding data 
This data has 4 datasets :
1. features 2. stores 3. test   4. train

Exploring features dataset

In [39]:
#reading features dataset
data_features = pd.read_csv(r'..\data\raw\features.csv',
                           parse_dates=["Date"])

In [40]:
# head and tail of features dataset
display(data_features.head())
display(data_features.tail())

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,2010-02-05,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2010-02-12,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,2010-02-19,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,2010-02-26,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,2010-03-05,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
8185,45,2013-06-28,76.05,3.639,4842.29,975.03,3.00,2449.97,3169.69,NaN,NaN,False
8186,45,2013-07-05,77.50,3.614,9090.48,2268.58,582.74,5797.47,1514.93,NaN,NaN,False
8187,45,2013-07-12,79.37,3.614,3789.94,1827.31,85.72,744.84,2150.36,NaN,NaN,False
8188,45,2013-07-19,82.84,3.737,2961.49,1047.07,204.19,363.00,1059.46,NaN,NaN,False
8189,45,2013-07-26,76.06,3.804,212.02,851.73,2.06,10.88,1864.57,NaN,NaN,False

In [41]:
# shape of data set (number of rows and columns)
print ("The number of rows in features dataset are", data_features.shape[0])
print ("The number of columns in features dataset are", data_features.shape[1])

The number of rows in features dataset are 8190
The number of columns in features dataset are 12

In [42]:
#info of datset(name and type of columns)
data_features.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   datetime64[ns]
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), datetime64[ns](1), float64(9), int64(1)
memory usage: 712.0 KB

INFERENCES FROM INFO OF DTATSET
This implies that the columns store,date,temperature ,fuel price and is holiday are filled , while there are Nan values in markdown,CPI and unemployment columns.
Also looking at the data types,columns store,,,=-5, ,and are folat typesnumerical in nature,.
the store column is int tyope whiTh shows that it is i,mplies stroore number.
Is goliday column show twhehtherhthe date is holiday or not. dDate is string and .
aLSO THE DATASET IS OF 3 YEARS ()

In [43]:
# describe datset
data_features.describe()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment
count,8190.000000,8190,8190.000000,8190.000000,4032.000000,2921.000000,3613.000000,3464.000000,4050.000000,7605.000000,7605.000000
mean,23.000000,2011-10-31 12:00:00,59.356198,3.405992,7032.371786,3384.176594,1760.100180,3292.935886,4132.216422,172.460809,7.826821
min,1.000000,2010-02-05 00:00:00,-7.290000,2.472000,-2781.450000,-265.760000,-179.260000,0.220000,-185.170000,126.064000,3.684000
25%,12.000000,2010-12-17 00:00:00,45.902500,3.041000,1577.532500,68.880000,6.600000,304.687500,1440.827500,132.364839,6.634000
50%,23.000000,2011-10-31 12:00:00,60.710000,3.513000,4743.580000,364.570000,36.260000,1176.425000,2727.135000,182.764003,7.806000
75%,34.000000,2012-09-14 00:00:00,73.880000,3.743000,8923.310000,2153.350000,163.150000,3310.007500,4832.555000,213.932412,8.567000
max,45.000000,2013-07-26 00:00:00,101.950000,4.468000,103184.980000,104519.540000,149483.310000,67474.850000,771448.100000,228.976456,14.313000
std,12.987966,NaN,18.678607,0.431337,9262.747448,8793.583016,11276.462208,6792.329861,13086.690278,39.738346,1.877259

In [44]:
# checking null values
data_features.isnull().sum()

Store              0
Date               0
Temperature        0
Fuel_Price         0
MarkDown1       4158
MarkDown2       5269
MarkDown3       4577
MarkDown4       4726
MarkDown5       4140
CPI              585
Unemployment     585
IsHoliday          0
dtype: int64

Exploring stores dataset

In [45]:
unique_val1 = data_features['Date'].unique()
print(unique_val1)

<DatetimeArray>
['2010-02-05 00:00:00', '2010-02-12 00:00:00', '2010-02-19 00:00:00',
 '2010-02-26 00:00:00', '2010-03-05 00:00:00', '2010-03-12 00:00:00',
 '2010-03-19 00:00:00', '2010-03-26 00:00:00', '2010-04-02 00:00:00',
 '2010-04-09 00:00:00',
 ...
 '2013-05-24 00:00:00', '2013-05-31 00:00:00', '2013-06-07 00:00:00',
 '2013-06-14 00:00:00', '2013-06-21 00:00:00', '2013-06-28 00:00:00',
 '2013-07-05 00:00:00', '2013-07-12 00:00:00', '2013-07-19 00:00:00',
 '2013-07-26 00:00:00']
Length: 182, dtype: datetime64[ns]

In [46]:
#reading stores dataset
data_stores = pd.read_csv(r'..\data\raw\stores.csv')

In [47]:
# head and tail of stores dataset
display(data_stores.head())
display(data_stores.tail())

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

    Store Type    Size
40     41    A  196321
41     42    C   39690
42     43    C   41062
43     44    C   39910
44     45    B  118221

In [48]:
# shape of data set (number of rows and columns)
print ("The number of rows in stores dataset are", data_stores.shape[0])
print ("The number of columns in stores dataset are", data_stores.shape[1])

The number of rows in stores dataset are 45
The number of columns in stores dataset are 3

In [49]:
#info of datset(name and type of columns)
data_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Store   45 non-null     int64
 1   Type    45 non-null     object
 2   Size    45 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

INFERENCES FROM INFO OF DTATSET(stores)
This implies that the columns store,type and size are filled.
Also looking at the data types,columns storeand size are numerical in nature.
Type column is string(with vlues 'A', 'B' and 'C')

In [50]:
# checking null values
data_stores.isnull().sum()

Store    0
Type     0
Size     0
dtype: int64

In [51]:
#reading train dataset
data_train = pd.read_csv(r'..\data\raw\train.csv', parse_dates=["Date"])

In [52]:
# head and tail of train dataset
display(data_train.head())
display(data_train.tail())

   Store  Dept       Date  Weekly_Sales  IsHoliday
0      1     1 2010-02-05      24924.50      False
1      1     1 2010-02-12      46039.49       True
2      1     1 2010-02-19      41595.55      False
3      1     1 2010-02-26      19403.54      False
4      1     1 2010-03-05      21827.90      False

        Store  Dept       Date  Weekly_Sales  IsHoliday
421565     45    98 2012-09-28        508.37      False
421566     45    98 2012-10-05        628.10      False
421567     45    98 2012-10-12       1061.02      False
421568     45    98 2012-10-19        760.01      False
421569     45    98 2012-10-26       1076.80      False

In [53]:
# shape of data set (number of rows and columns)
print ("The number of rows in train dataset are", data_train.shape[0])
print ("The number of columns in train dataset are", data_train.shape[1])

The number of rows in train dataset are 421570
The number of columns in train dataset are 5

In [54]:
# checking null values
data_train.isnull().sum()

Store           0
Dept            0
Date            0
Weekly_Sales    0
IsHoliday       0
dtype: int64

In [55]:
unique_val2 = data_train['Date'].unique()
print(unique_val2)

<DatetimeArray>
['2010-02-05 00:00:00', '2010-02-12 00:00:00', '2010-02-19 00:00:00',
 '2010-02-26 00:00:00', '2010-03-05 00:00:00', '2010-03-12 00:00:00',
 '2010-03-19 00:00:00', '2010-03-26 00:00:00', '2010-04-02 00:00:00',
 '2010-04-09 00:00:00',
 ...
 '2012-08-24 00:00:00', '2012-08-31 00:00:00', '2012-09-07 00:00:00',
 '2012-09-14 00:00:00', '2012-09-21 00:00:00', '2012-09-28 00:00:00',
 '2012-10-05 00:00:00', '2012-10-12 00:00:00', '2012-10-19 00:00:00',
 '2012-10-26 00:00:00']
Length: 143, dtype: datetime64[ns]

In [56]:
#info of datset(name and type of columns)
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  datetime64[ns]
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), datetime64[ns](1), float64(1), int64(2)
memory usage: 13.3 MB

INFERENCES FROM INFO OF DTATSET(train)
This implies that all the columns are filled.
Also looking at the data types,columns store, dept and weekly sales are numerical in nature.
Is holiday column show whether the date is holiday or not. Date is string.

In [57]:
#reading test dataset
data_test = pd.read_csv(r'..\data\raw\test.csv', parse_dates=["Date"])

In [58]:
# head and tail of test dataset
display(data_test.head())
display(data_test.tail())

   Store  Dept       Date  IsHoliday
0      1     1 2012-11-02      False
1      1     1 2012-11-09      False
2      1     1 2012-11-16      False
3      1     1 2012-11-23       True
4      1     1 2012-11-30      False

        Store  Dept       Date  IsHoliday
115059     45    98 2013-06-28      False
115060     45    98 2013-07-05      False
115061     45    98 2013-07-12      False
115062     45    98 2013-07-19      False
115063     45    98 2013-07-26      False

In [59]:
# shape of data set (number of rows and columns)
print ("The number of rows in test dataset are", data_test.shape[0])
print ("The number of columns in test dataset are", data_test.shape[1])

The number of rows in test dataset are 115064
The number of columns in test dataset are 4

In [60]:
#info of datset(name and type of columns)
data_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 115064 entries, 0 to 115063
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Store      115064 non-null  int64
 1   Dept       115064 non-null  int64
 2   Date       115064 non-null  datetime64[ns]
 3   IsHoliday  115064 non-null  bool
dtypes: bool(1), datetime64[ns](1), int64(2)
memory usage: 2.7 MB

In [61]:
# checking null values
data_test.isnull().sum()

Store        0
Dept         0
Date         0
IsHoliday    0
dtype: int64

NFERENCES FROM INFO OF DTATSET(test)
This implies that all the columns are filled.
Also looking at the data types,columns store, dept  are numerical in nature.
Is holiday column show whether the date is holiday or not. Date is string.

MERGING DATASETS TO GET A COMBINED DATA FOR ANALYSIS (DEPENDENT VARIABLE BEING WEEKLY SALES)

In [64]:

# Merge the datasets using appropriate keys (columns) where they are common
# Merge train_data with stores_data based on 'Store'
combined_data = data_train.merge(data_stores, on='Store', how='left')

# Merge combined_data with features_data based on 'Store' and 'Date'
combined_data = combined_data.merge(data_features, on=['Store', 'Date'], how='left')
display(combined_data.head())
# Save the DataFrame to a CSV file
combined_data.to_csv(r"..\data\raw\merged.csv", index=False)

,Store,Dept,Date,Weekly_Sales,IsHoliday_x,Type,Size,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday_y
0,1,1,2010-02-05,24924.50,False,A,151315,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,1,2010-02-12,46039.49,True,A,151315,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,1,2010-02-19,41595.55,False,A,151315,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,1,2010-02-26,19403.54,False,A,151315,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,1,2010-03-05,21827.90,False,A,151315,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False